data/2Dinit/hexDomain/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.6                                   |
|   \\  /    A nd           | Web:      http://www.OpenFOAM.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1;

vertices        
(
    (0 0 0)
    (1 0 0)
    (1 1 0)
    (0 1 0)

    (0 0 0.1)
    (1 0 0.1)
    (1 1 0.1)
    (0 1 0.1)

);

blocks          
(
    hex (0 1 2 3 4 5 6 7) (16 16 1) simpleGrading (1 1 1)
);

edges           
(
);

boundary 
(
    left 
    {
        type patch;
        neighbourPatch right;
        faces
        (
            // Left 
            (2 3 7 6)
        );
    }
    right 
    {
        type patch;
        neighbourPatch left;
        faces
        (
            // Right
            (0 1 5 4)
        );
    }
    front 
    {
        type patch;
        neighbourPatch back;
        faces
        (
            // Front 
            (0 4 7 3)
        );
    }

    back 
    {
        type patch;
        neighbourPatch front;
        faces
        (
            // Back
            (1 2 6 5)
        );
    }

    emptyPatch 
    {
        type empty;
        faces
        (
            // Bottom
            (3 2 1 0)
            // Top
            (4 5 6 7)
        );
    }
);

mergePatchPairs
(
);

// ************************************************************************* //
