data/2Dinit/hexDomain/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  3.0.x                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     voFoamTestAdvection;

libs            ( "libvolSurfaceInterpolation.so" "libtwoPhaseValidation.so" );

startFrom       latestTime;

startTime       0;

stopAt          endTime;

deltaT          1; 

endTime         1000; // Perform 1000 random intersection tests.

writeControl    adjustableRunTime; // Do not write anything.
 
writeInterval   $endTime;

purgeWrite      0;

writeFormat     ascii;

writePrecision  15;

writeCompression uncompressed;

timeFormat      general;

timePrecision   6;

runTimeModifiable yes;

adjustTimeStep  no;

maxCo           1; 

maxAlphaCo      0.1;  

maxDeltaT       1;

// ************************************************************************* //
