data/2Dinit/hexDomain/system/geomTransportControlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.1.x                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      voFoamDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

reconstructionTolerance 1e-06; 

// DGNR Algorithm Settings
// nReconstructions 2; 
// nNormalCorrections 1; 
// criticalAngle 10;


// Swartz Algorithm Settings
nReconstructions 1; 
nNormalCorrections 10; 
criticalAngle 20;
normalFilterAngle 20; 
normalCorrectAlpha 1e-03;

// CCNR Algorithm Settings
//nReconstructions 3; 
//nNormalCorrections 1; 
//criticalAngle 45;
//normalFilterAngle 10; 
//normalCorrectAlpha 1e-02;

// Youngs Algorithm Settings
//nReconstructions 1; 
//nNormalCorrections 1; 


redistributionAlgorithm
{
    type globalRedistribution;
}

wispRemovalAlgorithm
{
    type none;
}

temporalIntegrator
{
    type composited; 

    cellDisplacementIntegrator
    {   
        type trapezoid;
    }

    pointCellInterpolator 
    {
        type Taylor; 
    }

    fluxIntegrator
    {
        type trapezoid;
    }
}

// TODO: Following parameters are unused by the algorithm.
// They should be set by the user to the appropriate values, so that the
// automatic testing harness can generate tables with raw data that are 
// distinguished by the method strategies. 

reconstruction DGNR;
fluxCorrection pyramid; 


// ************************************************************************* //
